2823439448/Farm-stm32/main/main.c
#include "stm32f10x.h"
#include "dht11.h"
#include "bh1750.h"
#include "uart.h"
#include "tim.h"
#include "control.h"
#include <stdio.h>

/* ---- 传感器数据（control.c通过extern访问） ---- */
volatile float   g_temp = 0;
volatile uint8_t g_humi = 0;
volatile float   g_lux  = 0;

/* ---- SysTick毫秒计数（control.c通过extern访问） ---- */
volatile uint32_t g_tick_ms = 0;

void SysTick_Handler(void) {
    g_tick_ms++;
}

int main(void) {
    char    txbuf[64];
    uint8_t raw_temp = 0, raw_humi = 0;

    /* SysTick配置为1ms中断（72MHz） */
    SysTick_Config(SystemCoreClock / 1000);

    /* 各模块初始化 */
    UART1_Init();
    BH1750_Init();
    DHT11_Init();
    TIM2_Init();
    TIM1_PWM_Init();
    Control_Init();

    /* 等待传感器上电稳定 */
    for (volatile uint32_t d = 0; d < 2000; d++) {
        /* 等约2秒（SysTick已启动可用delay，这里简单循环） */
        for (volatile uint32_t e = 0; e < 72000; e++) __NOP();
    }

    while (1) {
        /* ================================================
           1. 每分钟采样 + 上报 + 更新PID
           ================================================ */
        if (g_sample_flag) {
            g_sample_flag = 0;

            /* 读DHT11（失败则保留上次值） */
            if (DHT11_Read(&raw_temp, &raw_humi)) {
                g_temp = (float)raw_temp;
                g_humi = raw_humi;
            }

            /* 读BH1750 */
            g_lux = BH1750_Read();

            /* 拼包发送给ESP8266，格式：SENSOR:25,68,100.0\n */
            snprintf(txbuf, sizeof(txbuf),
                     "SENSOR:%d,%d,%.1f\n",
                     (int)g_temp, (int)g_humi, g_lux);
            UART1_Send(txbuf);

            /* 采样完成后执行一次PID计算更新热床功率 */
            Control_HeaterPID();
        }

        /* ================================================
           2. 处理ESP8266下发的CMD
           ================================================ */
        if (g_rx_ready) {
            g_rx_ready = 0;
            UART1_ParseCMD();
            /* PID目标值已在ParseCMD中更新g_target_temp/humid */
        }

        /* ================================================
           3. 水泵软PWM（高频轮询，10ms级响应）
           ================================================ */
        Control_PumpUpdate();

        /* ================================================
           4. 蜂鸣器超限报警（持续监测）
           ================================================ */
        Control_AlarmUpdate();
    }
}
/**
 ******************************************************************************
 * @file    main.c
 * @brief   基于STM32F103C8T6的农场环境管理系统
 ******************************************************************************
 *
 * 【硬件接线说明】
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                        供电系统                                          │
 * │                                                                          │
 * │  5V主电源                                                                │
 * │  ├── STM32板载LDO          → 3.3V → 供STM32/DHT11/BH1750              │
 * │  ├── LM2596S降压模块       → 3.3V → 专供ESP8266（+470μF滤波电容）      │
 * │  ├── 继电器模块VCC         → 直接接5V                                   │
 * │  ├── 风扇正极              → 继电器1 NO端（继电器切换通断）             │
 * │  ├── 水泵正极              → 继电器2 NO端（继电器切换通断）             │
 * │  └── 蜂鸣器正极            → 直接接5V（S8050三极管控制回路）           │
 * │  所有模块GND必须共地                                                     │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     DHT11 温湿度传感器                                   │
 * │                                                                          │
 * │  DHT11引脚        连接                                                   │
 * │  VCC         →   3.3V                                                   │
 * │  GND         →   GND                                                    │
 * │  DATA        →   PA1                                                    │
 * │                  └── PA1与3.3V之间接4.7kΩ上拉电阻（必须）              │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     BH1750 光照传感器（I2C1）                            │
 * │                                                                          │
 * │  BH1750引脚       连接                                                   │
 * │  VCC         →   3.3V                                                   │
 * │  GND         →   GND                                                    │
 * │  SCL         →   PB6  （I2C1_SCL，AF_OD模式）                          │
 * │  SDA         →   PB7  （I2C1_SDA，AF_OD模式）                          │
 * │  ADDR        →   GND  （I2C地址固定为0x23）                             │
 * │                  模块已板载4.7kΩ上拉电阻，无需外接                      │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     ESP8266 WiFi模块（USART1）                           │
 * │                                                                          │
 * │  ESP8266引脚      连接                                                   │
 * │  VCC         →   LM2596S输出3.3V                                        │
 * │                  （禁止接STM32板载3.3V，WiFi收发峰值电流可达350mA）     │
 * │  GND         →   GND（与STM32共地）                                     │
 * │  CH_PD       →   LM2596S输出3.3V                                        │
 * │                  （使能引脚，必须拉高，悬空模块不工作）                  │
 * │  TX          →   PA10（USART1_RX，IN_FLOATING模式）                    │
 * │  RX          →   PA9 （USART1_TX，AF_PP模式）                          │
 * │                  LM2596S输出端并联470μF电解电容平滑峰值电流冲击         │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     双路继电器模块                                        │
 * │                                                                          │
 * │  继电器引脚       连接                          控制对象                  │
 * │  VCC         →   5V                                                     │
 * │  GND         →   GND                                                    │
 * │  IN1         →   PB2  （OUT_PP，高电平触发）  → 控制风扇               │
 * │  IN2         →   PB0  （OUT_PP，高电平触发）  → 控制水泵               │
 * │                                                                          │
 * │  风扇回路：  继电器1_COM → 5V正极                                        │
 * │             继电器1_NO  → 风扇正极                                       │
 * │             风扇负极    → GND                                            │
 * │                                                                          │
 * │  水泵回路：  继电器2_COM → 5V正极                                        │
 * │             继电器2_NO  → 水泵正极                                       │
 * │             水泵负极    → GND                                            │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     蜂鸣器（S8050 NPN三极管驱动）                        │
 * │                                                                          │
 * │  PB1 → 1kΩ限流电阻 → S8050基极(B)                                      │
 * │  S8050发射极(E)     → GND                                               │
 * │  S8050集电极(C)     → 蜂鸣器负极                                        │
 * │  蜂鸣器正极         → 5V                                                │
 * │                                                                          │
 * │  PB1输出高电平 → 三极管导通 → 蜂鸣器回路接通 → 鸣响                   │
 * │  PB1输出低电平 → 三极管截止 → 蜂鸣器回路断开 → 静音                   │
 * │  （5V有源蜂鸣器驱动电流约30~50mA，超出GPIO输出上限，必须三极管驱动）  │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                     热床 MOS管驱动（TIM1_CH1 PWM）                      │
 * │                                                                          │
 * │  PA8（TIM1_CH1）→ 10kΩ下拉至GND → MOS管栅极(G)                        │
 * │  MOS管源极(S)   → GND                                                   │
 * │  MOS管漏极(D)   → 热床负极                                              │
 * │  热床正极       → 独立电源正极（按热床额定电压选择）                    │
 * │                  （10kΩ下拉防止PA8悬空时MOS管误导通）                  │
 * │  PWM占空比 0~100% → 热床加热功率 0~100%                                │
 * └─────────────────────────────────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                        引脚分配汇总                                       │
 * │                                                                          │
 * │  PA1   DHT11 DATA          单总线双向GPIO，外接4.7kΩ上拉至3.3V         │
 * │  PA8   TIM1_CH1 PWM        热床MOS管栅极，1kHz PWM，AF_PP              │
 * │  PA9   USART1_TX           → ESP8266 RX，AF_PP                        │
 * │  PA10  USART1_RX           ← ESP8266 TX，IN_FLOATING                  │
 * │  PB0   水泵继电器 IN2      OUT_PP，高电平触发继电器吸合                 │
 * │  PB1   蜂鸣器三极管基极    OUT_PP，高电平触发S8050导通                  │
 * │  PB2   风扇继电器 IN1      OUT_PP，高电平触发继电器吸合                 │
 * │  PB6   I2C1_SCL            → BH1750 SCL，AF_OD                        │
 * │  PB7   I2C1_SDA            → BH1750 SDA，AF_OD                        │
 * └─────────────────────────────────────────────────────────────────────────┘
 */

